Подумайте, потребуются ли вам в проекте специфические структуры данных (например, какие-то особенные способы хранения объектов), 
поддерживающие и организующие работу с классами анализа, или достаточно будет обойтись возможностями стандартных библиотек.

Как вариант основными классами АТД как специфическими структурами данных могут выступать классы 
Field, который будет заполняться элементами и хранить их, а также иметь некоторые свои методы
Возможно Element, который будет иметь значения из выбора, в частности буквы A, B, C, D, E

